# FinalizedElementsWillBeModified Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..FinalizedElementsWillBeModified Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FinalizedElementsWillBeModified { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FinalizedElementsWillBeModified As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FinalizedElementsWillBeModified {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace